luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEth_reg.h
/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G011_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G011_LOW.
*/
#define	ETH_MAC_ADDRESS11_LOW	(ETH_MAC_ADDRESS_G011_LOW)

/** \brief  10A0, MAC Address High Register */
#define ETH_MAC_ADDRESS_G012_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E0A0u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G012_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G012_HIGH.
*/
#define	ETH_MAC_ADDRESS12_HIGH	(ETH_MAC_ADDRESS_G012_HIGH)

/** \brief  10A4, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G012_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E0A4u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G012_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G012_LOW.
*/
#define	ETH_MAC_ADDRESS12_LOW	(ETH_MAC_ADDRESS_G012_LOW)

/** \brief  10A8, MAC Address High Register */
#define ETH_MAC_ADDRESS_G013_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E0A8u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G013_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G013_HIGH.
*/
#define	ETH_MAC_ADDRESS13_HIGH	(ETH_MAC_ADDRESS_G013_HIGH)

/** \brief  10AC, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G013_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E0ACu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G013_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G013_LOW.
*/
#define	ETH_MAC_ADDRESS13_LOW	(ETH_MAC_ADDRESS_G013_LOW)

/** \brief  10B0, MAC Address High Register */
#define ETH_MAC_ADDRESS_G014_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E0B0u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G014_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G014_HIGH.
*/
#define	ETH_MAC_ADDRESS14_HIGH	(ETH_MAC_ADDRESS_G014_HIGH)

/** \brief  10B4, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G014_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E0B4u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G014_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G014_LOW.
*/
#define	ETH_MAC_ADDRESS14_LOW	(ETH_MAC_ADDRESS_G014_LOW)

/** \brief  10B8, MAC Address High Register */
#define ETH_MAC_ADDRESS_G015_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E0B8u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G015_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G015_HIGH.
*/
#define	ETH_MAC_ADDRESS15_HIGH	(ETH_MAC_ADDRESS_G015_HIGH)

/** \brief  10BC, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G015_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E0BCu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G015_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G015_LOW.
*/
#define	ETH_MAC_ADDRESS15_LOW	(ETH_MAC_ADDRESS_G015_LOW)

/** \brief  1048, MAC Address High Register */
#define ETH_MAC_ADDRESS_G01_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E048u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G01_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G01_HIGH.
*/
#define	ETH_MAC_ADDRESS1_HIGH	(ETH_MAC_ADDRESS_G01_HIGH)

/** \brief  104C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G01_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E04Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G01_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G01_LOW.
*/
#define	ETH_MAC_ADDRESS1_LOW	(ETH_MAC_ADDRESS_G01_LOW)

/** \brief  1050, MAC Address High Register */
#define ETH_MAC_ADDRESS_G02_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E050u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G02_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G02_HIGH.
*/
#define	ETH_MAC_ADDRESS2_HIGH	(ETH_MAC_ADDRESS_G02_HIGH)

/** \brief  1054, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G02_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E054u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G02_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G02_LOW.
*/
#define	ETH_MAC_ADDRESS2_LOW	(ETH_MAC_ADDRESS_G02_LOW)

/** \brief  1058, MAC Address High Register */
#define ETH_MAC_ADDRESS_G03_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E058u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G03_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G03_HIGH.
*/
#define	ETH_MAC_ADDRESS3_HIGH	(ETH_MAC_ADDRESS_G03_HIGH)

/** \brief  105C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G03_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E05Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G03_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G03_LOW.
*/
#define	ETH_MAC_ADDRESS3_LOW	(ETH_MAC_ADDRESS_G03_LOW)

/** \brief  1060, MAC Address High Register */
#define ETH_MAC_ADDRESS_G04_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E060u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G04_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G04_HIGH.
*/
#define	ETH_MAC_ADDRESS4_HIGH	(ETH_MAC_ADDRESS_G04_HIGH)

/** \brief  1064, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G04_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E064u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G04_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G04_LOW.
*/
#define	ETH_MAC_ADDRESS4_LOW	(ETH_MAC_ADDRESS_G04_LOW)

/** \brief  1068, MAC Address High Register */
#define ETH_MAC_ADDRESS_G05_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E068u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G05_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G05_HIGH.
*/
#define	ETH_MAC_ADDRESS5_HIGH	(ETH_MAC_ADDRESS_G05_HIGH)

/** \brief  106C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G05_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E06Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G05_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G05_LOW.
*/
#define	ETH_MAC_ADDRESS5_LOW	(ETH_MAC_ADDRESS_G05_LOW)

/** \brief  1070, MAC Address High Register */
#define ETH_MAC_ADDRESS_G06_HIGH /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_HIGH*)0xF001E070u)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G06_HIGH.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G06_HIGH.
*/
#define	ETH_MAC_ADDRESS6_HIGH	(ETH_MAC_ADDRESS_G06_HIGH)

